import { Bot, GrammyError, HttpError, InlineKeyboard, InputFile, Composer } from "grammy";
import { MyContext } from "../types/types.js";

const start = new Composer<MyContext>(); 

const startCallback = ''; 

start.command("start", async (ctx: MyContext) => {
    try {
        await ctx.replyWithPhoto(new InputFile(`images/start.png`), {
            caption: "Приветствую тебя, искатель.\n\nЯ — Хранитель Древности. Не музейный смотритель и не просто рассказчик. Я тот, кто бережёт то, что время пытается стереть: мудрость, загадки, голоса тех, кто жил задолго до нас.\n\nЗдесь нет суеты. Только тишина старинных свитков, свет разума в темноте забвения и ключи — не к сундукам золота, а к себе самому.\n\nДревность не мертва. Прошлое - это ключ к настоящему.\n Готов начать? 🏺🦉",
            reply_markup: new InlineKeyboard()
                .text("📜 Загадки Хранителя", "qwests")
                .row()
                .text("🗝️ Тайник Хранителя", "zagadki")
                .row()
                .text("💎 Сокровищница")
                .text("🪙 Подписка", "podpiska"),
            parse_mode: "HTML",
            protect_content: true,
        });
    } catch (e) {
        console.log(e);
    }
});

export { start }; 
